#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.visitor_count: Reading...
data.archive_file.visitor_count: Read complete after 0s [id=ea03bc6db30f6f967914d29462e220154f9ed7ff]
data.aws_route53_zone.root: Reading...
data.aws_route53_zone.root: Read complete after 0s [id=Z061938037NWWQYAL4QNW]
data.aws_iam_policy_document.lambda_logging: Reading...
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=3546645223]
module.s3_bucket_for_website.data.aws_region.current: Reading...
module.s3_cf_logging.data.aws_canonical_user_id.this: Reading...
data.aws_iam_policy_document.lambda_assume_role: Reading...
module.s3_bucket_for_website.data.aws_canonical_user_id.this: Reading...
module.s3_cf_logging.data.aws_caller_identity.current: Reading...
module.s3_bucket_for_website.data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
module.s3_cf_logging.data.aws_region.current: Reading...
module.s3_bucket_for_website.data.aws_partition.current: Reading...
module.s3_bucket_for_website.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_cf_logging.data.aws_partition.current: Reading...
module.s3_cf_logging.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_bucket_for_website.data.aws_caller_identity.current: Reading...
module.s3_cf_logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_cf_logging.data.aws_caller_identity.current: Read complete after 0s [id=382878041746]
module.s3_bucket_for_website.data.aws_caller_identity.current: Read complete after 0s [id=382878041746]
module.s3_bucket_for_website.data.aws_canonical_user_id.this: Read complete after 0s [id=75b2b91820e9df6396fa564ef6186398e526c762eeefb9493f7dbd98d55a6dd1]
module.s3_cf_logging.data.aws_canonical_user_id.this: Read complete after 0s [id=75b2b91820e9df6396fa564ef6186398e526c762eeefb9493f7dbd98d55a6dd1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_execution will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_execution" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "kyle.mn"
      + domain_validation_options = [
          + {
              + domain_name           = "kyle.mn"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "kyle.mn",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
    }

  # aws_apigatewayv2_api.visitor_count will be created
  + resource "aws_apigatewayv2_api" "visitor_count" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "visitor-count-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)

      + cors_configuration {
          + allow_origins = [
              + "https://kyle.mn",
            ]
        }
    }

  # aws_apigatewayv2_integration.visitor_count will be created
  + resource "aws_apigatewayv2_integration" "visitor_count" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Lambda visitor count."
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.visitor_count will be created
  + resource "aws_apigatewayv2_route" "visitor_count" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /visitorCount"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.visitor_count will be created
  + resource "aws_apigatewayv2_stage" "visitor_count" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "v1"
      + tags_all      = (known after apply)

      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + route_key                = "GET /visitorCount"
          + throttling_burst_limit   = 50
          + throttling_rate_limit    = 25
        }
    }

  # aws_appautoscaling_policy.dynamodb_table_read_policy will be created
  + resource "aws_appautoscaling_policy" "dynamodb_table_read_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBReadCapacityUtilization:table/main-cloud-resume-stats"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/main-cloud-resume-stats"
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.dynamodb_table_write_policy will be created
  + resource "aws_appautoscaling_policy" "dynamodb_table_write_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBWriteCapacityUtilization:table/main-cloud-resume-stats"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/main-cloud-resume-stats"
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # aws_appautoscaling_target.dynamodb_table_read_target will be created
  + resource "aws_appautoscaling_target" "dynamodb_table_read_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "table/main-cloud-resume-stats"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

  # aws_appautoscaling_target.dynamodb_table_write_target will be created
  + resource "aws_appautoscaling_target" "dynamodb_table_write_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "table/main-cloud-resume-stats"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

  # aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "kyle.mn",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Cloudfront distribution for cloud-resume challenge"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + target_origin_id         = "main-kylemn"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "main-kylemn"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_control.s3_oac will be created
  + resource "aws_cloudfront_origin_access_control" "s3_oac" {
      + description                       = "Created by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = (known after apply)
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_dynamodb_table.stats-db will be created
  + resource "aws_dynamodb_table" "stats-db" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "stats"
      + id               = (known after apply)
      + name             = "main-cloud-resume-stats"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "stats"
          + type = "S"
        }
    }

  # aws_dynamodb_table_item.view-count will be created
  + resource "aws_dynamodb_table_item" "view-count" {
      + hash_key   = "stats"
      + id         = (known after apply)
      + item       = <<-EOT
            {
                  "stats": {"S": "viewCount"},
                  "viewCount": {"N": "0"}
              }
        EOT
      + table_name = "main-cloud-resume-stats"
    }

  # aws_iam_policy.lambda_execution will be created
  + resource "aws_iam_policy" "lambda_execution" {
      + arn         = (known after apply)
      + description = "IAM policy for lambda to update DynamoDB table"
      + id          = (known after apply)
      + name        = "main-lambda_execution"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for lambda to send logs to CloudWatch"
      + id          = (known after apply)
      + name        = "main-lambda_logging"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "main-iam_role_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "main-iam_role_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "main-iam_role_for_lambda"
    }

  # aws_lambda_function.visitor_count will be created
  + resource "aws_lambda_function" "visitor_count" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_function_payload.zip"
      + function_name                  = "main_increment_visitor_count"
      + handler                        = "app.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "LJv6ldKkhFMV/U3VlGC2os7Sb9/ZyQYblYZsYLibZJQ="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "main-cloud-resume-stats"
            }
        }
    }

  # aws_lambda_permission.visitor_count will be created
  + resource "aws_lambda_permission" "visitor_count" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "main_increment_visitor_count"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "main-AllowVisitorCountAPIInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_route53_record.cert["kyle.mn"] will be created
  + resource "aws_route53_record" "cert" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z061938037NWWQYAL4QNW"
    }

  # aws_route53_record.dns_record will be created
  + resource "aws_route53_record" "dns_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kyle.mn"
      + type            = "A"
      + zone_id         = "Z061938037NWWQYAL4QNW"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # random_id.bucket_name will be created
  + resource "random_id" "bucket_name" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.s3_bucket_for_website.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3_bucket_for_website.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket_for_website.aws_s3_bucket_logging.this[0] will be created
  + resource "aws_s3_bucket_logging" "this" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "s3AccessLog/"
    }

  # module.s3_bucket_for_website.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_bucket_for_website.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket_for_website.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_cf_logging.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3_cf_logging.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_cf_logging.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.s3_cf_logging.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.s3_cf_logging.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_cf_logging.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_cf_logging.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_id           = (known after apply)
  + api_route        = "GET /visitorCount"
  + api_uri          = (known after apply)
  + invoke_url       = (known after apply)
  + static_s3_id     = (known after apply)
  + website_root_url = "https://kyle.mn"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @elykkyle, Action: `pull_request`, Working Directory: ``, Workflow: `Plan deployment to prod`*